---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.AllGridSegmentsRemoved
source: html/cf2be07a-fd1e-0963-6c70-4b7cc3a1d169.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.AllGridSegmentsRemoved Property

Curtain grid lines must have at least one segment.

## Syntax (C#)
```csharp
public static FailureDefinitionId AllGridSegmentsRemoved { get; }
```